Revit 2027 API
ParameterTypeId.PointFlexibleConstrained Property
 "Constrained"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PointFlexibleConstrained { get; }
Public Shared ReadOnly Property PointFlexibleConstrained As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PointFlexibleConstrained {
	ForgeTypeId^ get ();
}
static member PointFlexibleConstrained : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace